load-tests/feed.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 180
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  defaults:
    headers:
      Content-Type: "application/json"
      Authorization: "Bearer {{ $processEnvironment.LOAD_TEST_TOKEN }}"

scenarios:
  - name: "Feed browsing"
    flow:
      - get:
          url: "/api/posts/feed?page=1&limit=10"
      - think: 2
      - get:
          url: "/api/events?page=1&limit=10"
      - think: 1
      - get:
          url: "/api/communities?page=1&limit=10"